tutorials/oldd/old/movingMeshRhoPimpleFoam/rhoPimpleArbitraryFoamCyclic/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleArbitraryFoam;//meshMoverFoam;//rhoCentralDyMFoam;

startFrom       latestTime;//startTime;

startTime       0;

stopAt          endTime;

endTime         2.0;

deltaT          1e-02;

writeControl    adjustableRunTime;

writeInterval   1e-1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.2;

maxDeltaT       1;

// ************************************************************************* //
